let poetry = [
{
    "couplets": [
        ["ہے مجھ کو بھی جنگ و طوفان سے بیاری", "جس طرح چاہ ہے امن کی فطرت کو میری"],
        ["ہے یہ جنتِ نعیم کی تصویر کا اثر", "جی مچلتا ہے کہ بنے میرا لہو میری سیاہی"],
        ["نہیں ہے یہ تکبیر میری بڑائی کے لیے", "یہ یاد ہے کہ میں خونخوار ہوں نہیں"],
        ["میں گل ہوں، جنگجوؤں میں میرا کیا کام تھا؟", "شاہد میرا لہو، شاہد میری بینائے سرمئی"],
        ["ظلم نے پڑھوائی میرے لہو سے بھی تسبیح", "نام میرا اب شہید، میں ہوں حمد و ثنائی"]
    ]
}, {
    "couplets": [
        ["شعلوں کی تپش سے موم کا پگھل جانا ", "اتنا آسان نہیں دل کا بدل جانا"],
        ["آج بھی گزرتی ہے ہم پہ قیامت ", "جب بھی ہوتا ہے تیری محفل سے نکل جانا"],
        ["بہت تلخ گزرتا ہے تیرا یوں ٹھکرانا ", "پر کس شمع کو گراں گزرا پروانے کا جل جانا؟"],
        ["آج بھی تیرے وہ مزاج ہیں قائم ", "پھر کیوں نہ ہو میرے دل کا مچل جانا"],
        ["کم ظرف! تجھ سے عشق ہے اتنا مشکل ", "جیسے شیرِ اسد سے لڑنا، طوفان میں چل جانا"]
    ]
}, {
    "couplets": [
        ["ابھی ہیں اور قصے باقی ", "از سوانح، با ساقی"],
        ["کچھ مستی کچھ آہنگ ", "اک شوقِ جمازیبی"],
        ["\"میں بھی کوئی گل ہوں؟\" ", "ہم نوا، گلِ لالی"],
        ["ہے اس قلم کا اندازِ ", "کشمیری و حجازی"],
        ["دشمن بھی اُٹھاتے اس کے مزے ", "میری بے خبر یاوریؔ"]
    ]
}, {
    "couplets": [
        ["نہ ساقی نہ دلبر نہ آشیانہ ", "بس ہے اک سراغِ نجاتِ دنیا"],
        ["نہ مے نہ ساغر نہ میخانہ ", "بس سرورِ شوق ہے چھایا ہوا"],
        ["بلا کہ بس پیش ہوتا ہے بس اک بہانہ ", "اب تو ہوتی ہے سازشِ سیاستانہ"],
        ["اب جب ساقی کو جانا ہی تھا تو کہہ نکلے ", "شبِ شوق ہو کبھی تو آ جانا"],
        ["یہ بادہ و ساغر کی تصویر ہے دل فریب ", "اور یہ میخانہ، یہ عشقِ خراماں"]
    ]
}, {
    "couplets": [
        ["چمن کے گل ہم کو تم یاد دلاتے رہیں ", "نظریں بھی تیری بزم سے ہم چراتے رہیں"],
        ["سن لو میری آہ و زاری اگر سننی ہو ", "کہ کیسے تیری یاد میں قافیے سے قافیہ ملاتے رہیں"],
        ["کچھ خبر نہیں تم کس کارواں میں ہو مسافر ", "ہم یہاں ٹھہرے خود کو رُلاتے رہیں"],
        ["شوق سے یہاں شیشوں کو ہم بھرتے رہیں ", "تیری یاد میں خود کو ہم زہر پلاتے رہیں"],
        ["تیرا رُو، وہ ماہِ رُو، وہ گل بدن ہے کہاں ", "تیرے حسن کو بنا گیت ہم گاتے رہیں"]
    ]
}, {
    "couplets": [
        ["دل سے اٹھتے تیرے جذبات کا ہم کو بھی پتا ہے ", "ولولۂ جنوں کے درجات کا ہم کو بھی پتا ہے"],
        ["تو ہو کہ سیّارِ باطن یا سیّارِ مغرب ", "تیرے خرافات کا ہم کو بھی پتا ہے"],
        ["ابھی کارواں یوں ہی چلتا رہے گا ", "پر تیرے خیالات کا ہم کو بھی پتا ہے"],
        ["بچھڑ کے ابھی کوئی لمحہ نہیں گزرا ہوگا ", "کہ تیرے دل کی نشاط کا ہم کو بھی پتا ہے"],
        ["گمراہی متوحش نہیں کرتی ہمیں ", "انما الاعمال بالنیات کا ہم کو بھی پتا ہے"]
    ]
}, {
    "couplets": [
        ["سلسلۂ شوق میں دیکھیں گے یہی قلب و نظر ", "کیسے بنے گا تیرا جہاں یہی گاہِ گزر"],
        ["ابھی تو ہے شام ہی سہی ", "چلتے چلتے آ جائے گا نیا سحر"],
        ["کہیں ناکامی ہوئی بھی اگر، کرے گا پیدا ", "یہی سلسلۂ شوق اور منزل، اور سفر"],
        ["یہ شوق تیری پہچان ہے اے آدم ", "لمحہ لمحہ موج تیری دل سے اٹھتی ہے مثلِ بحر"],
        ["آصفوں کا ہوا ہم سے کیا اِک گزر ", "ہم سمجھ بیٹھے خود کو اہلِ نظر"],
        ["ہمیشہ بس ناکامیاں ہی ہوئیں ", "میری سعیوں کا کب ہوگا حاصل ثمر"],
        ["ہم تو درِ انتظارِ قیامت ہے ", "آگے پیچھے ہے بس یہاں ظالم ظفر"],
        ["آج بھی ہوں تاریکیوں میں نغمہ زن ", "\"قرآن است در شب نورِ قمر\""],
        ["مٹ گئی ہے آصفوں سے چمک ", "ہو گئی بے منزل یہ جستجو و سفر"]
    ]
}, {
    "couplets": [
        ["یہ دل ہے کوئی گزرگاہ تو نہیں ", "یہاں ٹھہر جانا کوئی گناہ تو نہیں"],
        ["یہ گل ہے کہ کوئی کانٹا ہے ", "دور سے ہی دیکھ جاؤ ایسی نگاہ تو نہیں"],
        ["کھڑی ہو گئی فجر کی جماعت ", "خواب ہی ہوگا، ابھی تو صبح تو نہیں"],
        ["اس امید سے عدالت میں آیا ہوں ", "کہ یہ کوئی شاہ کی بارگاہ تو نہیں"],
        ["ایسا نہ ہو کہ یاور ہو زیاں ", "کہ اُس کے سوا اُس کی کوئی پناہ تو نہیں"]
    ]
}, {
    "couplets": [
        ["کرتا تھا کوئی سرما بھی کوئی نخلستان بھی ", "کرتا ہے اب مہمان ہم کو ریگستان بھی"],
        ["ابھی بچے ہیں یہاں کچھ اور دن ", "پھر درمان، پھر دیکھنا ہے قبرستان بھی"],
        ["جو پایا اس کو تھاما، جو چھوٹا اسے چھوڑ دیا ", "کس کا تھا گمان ذہن سے مٹ جائے گا یہ دبستان بھی"],
        ["کبھی بس بستے میں ایک بوجھ ہی تھا ", "آج پڑھو تو اک علامت ہے کتابِ بہارستان بھی"],
        ["اب تو ہے یہی میری زبان پر ", "کشمیر زندہ باد، زندہ باد پاکستان بھی"]
    ]
}, {
    "couplets": [
        ["ہم خوش ہیں کہ بنامِ بے غیرت مریں ", "اس جہل سے کہیں دور گمنام کہیں با حکمت مریں"],
        ["اگر نصیب نہیں موقع تو کیوں فساد پیدا کریں ", "یہ کافی ہے ہم طالبِ شہادت مریں"],
        ["کوئی فتح قریب تو نہیں دکھتی ہمیں ", "کیوں اپنوں کے لیے بس ایک سامانِ عبرت مریں"],
        ["کچھ قطرے خون سے بجھ جاتی ہوگی تمہاری پیاس ", "ہم کو طلب ہے انصاف کی؛ کیوں نہ در انتظارِ قیامت مریں"],
        ["اگر سہی نہیں جاتی ہے ہر روز کی یہ داستان ", "صبر کے ساتھ خدا کے حضور لے کے شکایت مریں"]
    ]
}, {
    "couplets": [
        ["کر لو، کر لو عیش، پھر تو آنی آنی ہے ", "کر لو، کر لو عذر پیش، پھر تو آنی آنی ہے"],
        ["اے ظالم! کیا انتہا پا ر کرے گا ظلم کی؟ ", "اب کہہ بھی دو: \"ہاں، کم و بیش!\" پھر تو آنی آنی ہے"],
        ["ابھی اٹھا لو مُلّا دنیا کے مزے، ", "رکھ لو لمبے کیس و ریش پھر تو آنی آنی ہے"],
        ["کیا ہونا چاہیے پہلے: انصاف یا مفاد؟ ", "کہہ دو کہہ دو مفاد و دیش پھر تو آنی آنی ہے"],
        ["جب وہ ملک سُورہ لے کے آیا، ", "فَرِستادہؔ لپیٹے خیش پھر تو آنی آنی ہے"],
        ["حاشیہ",
            "فَرِستادہؔ یعنی رسول اللہ صلی اللہ علیہ وسلم"
        ]
    ]
}, {
    "couplets": [
        ["چوٹ پہ کبھی مرہم نہیں لگا، اب درد کی عادت سی لگی ", "چند لمحوں کا فریب تھا، ہم کو رفاقت سی لگی"],
        ["کوئی گل ہی تھا یا کوئی چہرہ دیکھا تھا؟ ", "چھوتے ہی بکھر جائے ایسی نزاکت سی لگی"],
        ["تہذیب کے اس یلغار میں کون کس طرف؟ ", "وہ اپنے آپ میں شاہد کی شہادت سی لگی"],
        ["وہ تمنا رہی ہم کو کچھ دیر ہی سہی ", "پر طلب ایسی تھی کہ ہم کو حسرت سی لگی"],
        ["وہ لالہ زار، وہ سبز میدان و آبشار ", "اُس وقت ہم کو یہ زینتیں کفایت سی لگی"]
    ]
}, {
    "couplets": [
        ["اب منزل ہے، کبھی بس اک خیال آیا تھا ", "تمنا ہی مٹ گئی جب وقتِ وصال آیا تھا"],
        ["اب شاید میں پھر سے چلوں اسی راہ پہ ", "پہلے چوک گیا تھا میں جب حکمِ کمال آیا تھا"],
        ["میں گر گر کے بھاگا منزل کی اور، پھر گر کے نہ اٹھا ", "کیا کرتا کہ تب نظر بس تیرا خط و خال آیا تھا"],
        ["جب تجھے دیکھا، تھی ہوا میں خوشبو ", "تہذیب میں تیرے ترنم، نظر مثالِ جمال آیا تھا"],
        ["اب بھی وہ سحر ہے تیرے جمال کا لیکن ", "تیرے اخلاق بھی دیکھے ہیں جب وہ احتمال آیا تھا"],
        ["گل سمیٹتا ہوں، اس لیے اس لالہ زار میں آج ", "لینے اور مہک اور تصویر آج کہ شوقِ ارتجال آیا تھا"]
    ]
}, {
    "couplets": [
        ["اگر اب بھی ہو وہ شوقِ شعر و سخن تو کیا کہنے ہو ", "اگر اب بھی ہو وہ بہارِ چمن تو کیا کہنے ہو"],
        ["گھر سے کہیں دور ہوں کسی انجان دہر ", "اگر اب بھی ہو وہ نشیمن تو کیا کہنے ہو"],
        ["دکھ درد سمیٹے بیٹھا ہوں ", "کہ دکھ بانٹنے کو ملے کوئی ہم وطن تو کیا کہنے ہو"],
        ["جنگ و جدال ہے ہر طرف برپا یہاں ", "ہو بس اگر انتظامِ کفن تو کیا کہنے ہو"],
        ["ہر طرف ہے چرچا میرے گناہوں کا ", "صفائی کو ملے الفاظ کا پیرہن تو کیا کہنے ہو"],
        ["پسِ پردہ ہو اور ابھی سے یہ حال ہے ", "دیکھ لیا تو رک ہی جائے گی دھڑکن تو کیا کہنے ہو"],
        ["بندۂ جدید ہے شوق و فرصت سے خالی ", "کبھی ملے اس کو شام اور خالی ذہن تو کیا کہنے ہو"],
        ["صدیوں سے پھول نہیں دیکھے ہیں میں نے ", "آج جائے قرار ہو درکنارِ گلشن تو کیا کہنے ہو"]
    ]
}, {
    "couplets": [
        ["اپنی آنکھیں بند کر لیتی ہے دنیا", "ایسے ہی کنارے کر دیتی ہے دنیا"],
        ["غم نہ کھا، اے فلسطین، تیرا سب کچھ لُٹ گیا", "\"اب یہ آخری بار\" کہہ دیتی ہے دنیا"],
        ["میرا دل چیر چیر، تنہائیوں میں میں تو رویا", "کچھ جزا فضا ہو بھی اگر، پھر بھول جاتی ہے دنیا"],
        ["تب بھی ہم لاچار، اب بھی ہم لاچار", "روز روز ہم پہ روند کے گزر جاتی ہے دنیا"],
        ["وہ شاید کل کے قصے ہیں امن و امان کے", "شاید کہ تا قیامت اسی کے خواب دیکھتی ہے دنیا"],
        ["اب نہ لکھے گا یاورؔ کوئی اور دردِ حیات", "ایسے ہی نہیں، جرمِ ضعیفی معاف کرتی ہے دنیا"]
    ]
}, {
    "couplets": [
        ["بس چندیا گئی آنکھیں اس روشنیِ بیکار سے", "تیرے سوا کہیں دل نہ لگا کسے لالہ زار سے"],
        ["کہنے کو تو کہتے ہیں کہ گریز ہے اب پیار سے", "معلوم ہے کہ ہر دن گزرتے ہیں یہ دلوں کے بازار سے"],
        ["یہاں کوہِ دامن ہے، اس ندی شور بھی", "پھر کیا مزہ آئے گا وہاں سیمنٹ کے امبار سے"],
        ["چلو یارو نکلیں کہیں شوق سے گلزار میں", "کیا پتا کل چھڑ جائے گی جنگ کس یار سے"]
    ]
}, {
    "couplets": [
        ["انسان کے لیے جلے ہیں شمعِ موم کتنے", "طمعِ انسان نے جلائے شہرِ روم کتنے"],
        ["اک شاخ تھی نگہبان، تھی ظلِ الٰہی", "اب اس شاخ پہ جمع ہیں یہ بم کتنے"],
        ["اطمینان نہ ہے ان کو، جو ہے اس پہ", "نجانے مٹیں گے اس خواب پر معصوم کتنے"],
        ["اب کھل گئے ہیں ہم پہ اور اثر و رموز", "نجانے اب جڑیں گے نئے فاقۂ صوم کتنے"],
        ["کہتے ہو کہ ہم تو مسافر ہیں، اک جگہ کیسے رہیں", "نجانے بنائے ہوں گے تم نے عشق محروم کتنے"]
    ]
}]


const pages = [
    `اک داغ بھی تم پر نہیں ہے گوارا، اے وطن
اک سانس بھی تجھ بن نہیں ہے گوارا، اے وطن
غم نہ کھا کہ دشمن ہیں تیرے کئی، اے ارضِ پاک
اب بھی جواں ہے ہم میں وہی شرارہ، اے وطن
ہم امین ہیں تیرے، اے حاملِ فردوسِ زمیں
کہیں سرخ میدان، کہیں تُو رنگِ بہاراں، اے وطن
یاور ہو تم مظلوموں کے، اے مرکزِ یقین
اے ظلِّ الٰہی، ہے الٰہی تیرا سہارا، اے وطن`,
    `ولو گُلو گُلزار وَندے
بہٕ پنٕنی دِلُک شٮؠہجار وَندے
ہؠک نہ مےٚ از تام کٕنٛسؠ وَنِتھ
اَز بہٕ چانہ خٕترٕ اِظہار وَندے
دِنہٕ خٕترٕ چھِم نہ ہار تہ دیار
اگر ژٕ وَنَکھ، پننؠ شعار وَندے
مَتے ژٕ کَتے آسٕکھ فؠران
بہٕ صبرٕ سان ژے اِنتظار وَندے
چھٮ۪کھ کیا مےٚ ازماوان، ژٕ حُکم کر
بہٕ پنُن پان ژے جان نثار وَندے
اَز چھُس بہٕ سفرَس منٛز کُنُے
یِکھنا، بہٕ پنُن پان رازدار وَندے`,
    `بۄنہِ ژھایہِ فِکرِ ترٛووُس، چھُ تارُک ژندر سون نِشان
زوٗنہِ گاشَن نِندرِ پووُس، چھُ بۄنہِ وۄتھَر سون نِشان
سأنِس وَطنَس دُہَے وَندٕ اوس کرٛوٗٹھ
شِنہ پَتہ چھُ میوٗٹھ سٕنٛتہٕ ژِتھٕر سون نِشان
مأدانَو کٲتیا کھے سأنؠ جوان
ملکک سُہ چھُ نا صبر سون نِشان
اگر آسن وَنؠ کٕنہہ دۄہ تقدیرس
وُمید چھِم روزِ خیالن ہُنٛد تھَزَر سون نِشان`,
    `جب ختم ہوئی میری نقد کی عِقد
تب سے مرید ہوں اور تم میرے پیر
تم امامِ عجم ہوں تم امامِ امیر
تم امامِ عرب ہوں تم امامِ بے نظیر

کہ تم فرستادۂ خدا ہو، شر سے بالاتر
تیری ذات میں پنہاں انسانی اوصاف کا اتمام
اے کہ تیرے آمد پر تھا جہالت کا اہتمام
کہ تیری ذات سے ہو روشن عرب تمام

وہ ارضِ خطہ، وہ اسماعیل کاخطہ
وہ ارضِ بیت اللہ جہاں دو دین اب حرام
نہ رہا ہیگل کا قلعہ نہ رہے افلاطون کے اوہام
مٹ گئے ہمارے ذہن سے ان کے نشان تمام

بنا اس کے جینا ہے بس فائدہ و نفع
نہ حیائے دنیا، نہ خوفِ محشر
یہ سفر ہے عقل سے نقل کا سفر
یہ علم ہے ارتقا و شر سے بالاتر`,
    `گَتھ چھُس کَران أندؠ أندؠ کَعْبَس
وَنتَم کِیا لیکھ تھم حِسابَس
وَحدَتُ الوجود تے یِظہارِ جَسَد
ڈیکہ چھِ یِمو نِش پاک خۄدایَس
کِیا مِلیو خۄدایَس عُرسے عُرسے
بیون بیون ٲسؠ أسِہ، آساو وُجودَس
شِرکَن چھُ وولمُت نیال سرودس
اَنتو نو بَہار نورِ تَوحیدس
سَرقَش چھُ کورمُت لُکو مَقامِ نَبی
دِتِہ پوز مانے نَبی نِس دَرودَس
اکوے مؠوا مَنع اوس جانِ جانانَس
ژےٛ کٔمٕیو وۄنؠ ژٕ زہد رَٹ پانَس`,
    
    
    `چِھم اُمید شَامس گَژھِ سٮؠحر تہٕ کیاہ
تۄتِ روزِ اَندیشہِ سؠٮحرِ مٮ۪ہر تہٕ کیاہ
چھُ وَسان اَز میٛٲنِس چَمنَس تہِ روٗد
کَھژِ کَنہہ گُل، ہۄژِ کَنہہ صَنوبر تہٕ کیاہ
آیم نَظر سۄ اَکھ زٕژ سٮ۪ژنؠ سُمبَتھ
اَنؠگَٹِس منٛز تابہ وونؠ مَہنوٗر تہٕ کیاہ
چُھس پَریشان آبشارَس تَل کُنی
آبِ شَفاف گو سَفید ہَوُن مُصَوِر تہٕ کیاہ
زَمانہٕ اگر دِیٖنہٕ حیثیت
کونہِ روزٕ گٮ۪وان تا عُمر تہٕ کیاہ
نظمِ لوت لوت معنے جوٗڈُم
تۄتِ روزٕم نظم بے بحر تہٕ کیاہ
حَیراں پَریشان چھُ اِنسان گَسان
چھُم بَس اگر شَرحِ صَدر تہٕ کیاہ
کۄتا تٛرکُر چھُ اِنسان گوٗمُت
چھُ بَس اَکھ ماز بون، خوٗنِ جِگر تہٕ کیاہ
شوق چھُم اَوی چھُسٕے بوزناوان
چھُم مَژر نَتہٕ واحِیاتِ یاورؔ تہٕ کیاہ`,
    
    
    `دیمِ نشاتٕ ننؠدرِ ؤژھ 
شیطانِ پاٹھؠ نستِ کھژ
کتھ چھُکھ موج ونان؟
یہ چھے صِرف مێژ تہ پێژ

چون تَمَح مے رۆد
چُھ لؠکھان قَلمِ رَفت بُود:
گۄلاب تھٔرِ چِھ کینٛڈؠ رأچھ
تۄتہِ چُھ عِشق پُر سُود

ہؠرِ چِھم جَيْحُون؛ لرِ چِھم دجلہ
آلو دِوان چھؠم : لا إله إلا الله
دپان جنّتس تہِ چھِہ فرات
آسیا جہلم؛ یی چھُ معما`,
    
    
    `صداۓ افلاس ہے اور کیا
بحرِ بے شناس ہے اور کیا
​اب بس تیرے لیے ایمان
ایک مجرد احساس ہے اور کیا
​"علم میں میرا نہیں ہے مقام"
یہ غلط تیرا قیاس ہے اور کیا
​تو بہت گرم جوش ہے آج
مغلوب تیرے حواس ہے اور کیا
​اس تاریکی میں بھی قائم ہے تیرا گمان
"ہم عاموں میں خاص ہیں اور کیا"`,
    `تٔمؠ دۄہ رۄزٕے نہ کانٛہ موٗدمُت
ژھٕ کٔمُک چھُی گُمانی؟
ژھٕ کُس یِییی ساتھَس؟
یلِ قرآن گَسِ آیانی

یہ نظمٕ لؠکھؠ لؠکھؠ کیا چھُے پَرنَوان؟
یہ کوس شَہمَتھ چھُی فورناوان؟
یلِ تَتہِ وُچھَکھ پَنَہ آچھو
شِرکُک رۄز نہ نِشانی

غفلتس منٛز تہِ چھا زندگی؟
کَر خُدا سٕنٛز بندگی
اَمؠ بروہ زِ
کُفر رۄز نہ اِمکانی`,
    `
    اَکھ چُھوی شیٖشہ ہیتھ پیاران
اَکھ چُھوی گُلدَستہ لئے
اَکھ چُھوی جامُک یاران
اَکھ چُھوی جامہ پیے`,
    `​بہِ وَسے نہ ہیرِ بون لو لو
پوشِہ وارے چہم یتے زن لو لو
ژھونمُت چُھس بہِ یور آمُت
وَیسے چُہم مَخمَل زیبِ تن لو لو
کۆت کَلا ژے یِظہارَس لوگُی
مُحبتُک کَلِمہِ وَن تہِ وَن لو لو
سیوز وَتھ چھے سوہ چانی
یا خُدا ژئی مے رہبَر بَن لو لو
لَيْسَ كَمِثْلِهِ شَيْءٌ
اَتھ کَتھِے ژے سَن لو لو`,
    `
گیوان گیوان بہ دیوان گووُس نا
برتل بہ چانہ ودان ودان گووُس نا
عشقنٕی نارٕ چھُم پریشان دِل
خونِ جگر بہ چوان چوان گووُس نا
چانہ محفلؠ منٛز ییٚلہِ سُہ منظر گو
بہٕ دِلس نار ہیوان ہیوان گووُس نا
جامہٕ ژٔٹِم مےٚ گل ژھانٛڈان ژھانٛڈان
ییٚلہِ نہٕ آو اتھؠ؛ بہ نی ووان گووُس نا
یِمؠ پھرِ مےٚ کانٛہہ نو قوافی مِلیو
بہٕ جامہٕ کَتھن والان والان گووُس نا
بہٕ نارِ عشقن ترٛوُس نہ کُنہِ کُی
بہٕ وٲدی وٲدی پھِران پھِران گووُس نا
مےٚ آز تہِ رہبر خداے یکتا چھُم
عمل چھِم کمزور اَوَے ڈلان گووُس نا
بہٕ نارٕ عشقن اندری زولنس
بہٕ قبرِ دِلس سوٗر پھِران پھِران گووُس نا`.trim(),
    `یادوں کے سہارے اب تو جینا ہے
ابھی ہم کو زہر بھی پینا ہے
آتش، تو آتش کدہ میں نہ جا
آتش، تیرے لیے میرا سینہ ہے
آ کہ مجھ کو سنا جا دردِ حیات
تو گا، محفل میں ستار و وینا ہے
چاک جو دل ہوگا تو سن لینا
اس میں اور جو دردِ خِینا ہے
تو آگاہ رہنا اس بات سے، یاورؔ
تیری آواز میں دیوانگی کا قرینہ ہے`,
    `ییلہ یار مِلے؛ پان نیے
دٕدؠمتِس گُلزار ییے
زووَس کُفرک ناو مِٹے
ماجِِہ زَن نیے زیے
اگر کہں ژؠھ آسے، بہ کَر
بَسَر زِندگی شوقُک جام پِیے
اَتھ جامَس کَر تہ تکمیل
پٮ۪ٹھ حجاب تاج دِیے
زوٗنی ڈالُم تے نقاب
زے چھُس ما شاء اللہ لیے`
]


for (let i = 0; i < pages.length; i++) {
    const poem = { couplets: [[]] }
    const lines = pages[i]
        .split("\n")
        .map(s => s.trim())
    
    if (lines.includes("")) {
        for (const line of lines) {
            if (line === "") {
                if (poem.couplets[poem.couplets.length - 1].length > 0) {
                    poem.couplets.push([])
                }
                continue
            }
            poem.couplets[poem.couplets.length - 1].push(line)
        }
    } else {
        for (const line of lines) {
            if (poem.couplets[poem.couplets.length - 1].length === 2) {
                poem.couplets.push([])
            }
            poem.couplets[poem.couplets.length - 1].push(line)
        }
    }

    if (poem.couplets[poem.couplets.length - 1].length === 0) {
        poem.couplets.pop()
    }

    poetry.unshift(poem)
}