let poetry = [{
    "couplets": [
        ["شعلوں کی تپش سے موم کا پگھل جانا ", "اتنا آسان نہیں دل کا بدل جانا"],
        ["آج بھی گزرتی ہے ہم پہ قیامت ", "جب بھی ہوتا ہے تیری محفل سے نکل جانا"],
        ["بہت تلخ گزرتا ہے تیرا یوں ٹھکرانا ", "پر کس شمع کو گراں گزرا پروانے کا جل جانا؟"],
        ["آج بھی تیرے وہ مزاج ہیں قائم ", "پھر کیوں نہ ہو میرے دل کا مچل جانا"],
        ["کم ظرف! تجھ سے عشق ہے اتنا مشکل ", "جیسے شیرِ اسد سے لڑنا، طوفان میں چل جانا"]
    ]
}, {
    "couplets": [
        ["ابھی ہیں اور قصے باقی ", "از سوانح، با ساقی"],
        ["کچھ مستی کچھ آہنگ ", "اک شوقِ جمازیبی"],
        ["\"میں بھی کوئی گل ہوں؟\" ", "ہم نوا، گلِ لالی"],
        ["ہے اس قلم کا اندازِ ", "کشمیری و حجازی"],
        ["دشمن بھی اُٹھاتے اس کے مزے ", "میری بے خبر یاوریؔ"]
    ]
}, {
    "couplets": [
        ["نہ ساقی نہ دلبر نہ آشیانہ ", "بس ہے اک سراغِ نجاتِ دنیا"],
        ["نہ مے نہ ساغر نہ میخانہ ", "بس سرورِ شوق ہے چھایا ہوا"],
        ["بلا کہ بس پیش ہوتا ہے بس اک بہانہ ", "اب تو ہوتی ہے سازشِ سیاستانہ"],
        ["اب جب ساقی کو جانا ہی تھا تو کہہ نکلے ", "شبِ شوق ہو کبھی تو آ جانا"],
        ["یہ بادہ و ساغر کی تصویر ہے دل فریب ", "اور یہ میخانہ، یہ عشقِ خراماں"]
    ]
}, {
    "couplets": [
        ["چمن کے گل ہم کو تم یاد دلاتے رہیں ", "نظریں بھی تیری بزم سے ہم چراتے رہیں"],
        ["سن لو میری آہ و زاری اگر سننی ہو ", "کہ کیسے تیری یاد میں قافیے سے قافیہ ملاتے رہیں"],
        ["کچھ خبر نہیں تم کس کارواں میں ہو مسافر ", "ہم یہاں ٹھہرے خود کو رُلاتے رہیں"],
        ["شوق سے یہاں شیشوں کو ہم بھرتے رہیں ", "تیری یاد میں خود کو ہم زہر پلاتے رہیں"],
        ["تیرا رُو، وہ ماہِ رُو، وہ گل بدن ہے کہاں ", "تیرے حسن کو بنا گیت ہم گاتے رہیں"]
    ]
}, {
    "couplets": [
        ["دل سے اٹھتے تیرے جذبات کا ہم کو بھی پتا ہے ", "ولولۂ جنوں کے درجات کا ہم کو بھی پتا ہے"],
        ["تو ہو کہ سیّارِ باطن یا سیّارِ مغرب ", "تیرے خرافات کا ہم کو بھی پتا ہے"],
        ["ابھی کارواں یوں ہی چلتا رہے گا ", "پر تیرے خیالات کا ہم کو بھی پتا ہے"],
        ["بچھڑ کے ابھی کوئی لمحہ نہیں گزرا ہوگا ", "کہ تیرے دل کی نشاط کا ہم کو بھی پتا ہے"],
        ["گمراہی متوحش نہیں کرتی ہمیں ", "انما الاعمال بالنیات کا ہم کو بھی پتا ہے"]
    ]
}, {
    "couplets": [
        ["سلسلۂ شوق میں دیکھیں گے یہی قلب و نظر ", "کیسے بنے گا تیرا جہاں یہی گاہِ گزر"],
        ["ابھی تو ہے شام ہی سہی ", "چلتے چلتے آ جائے گا نیا سحر"],
        ["کہیں ناکامی ہوئی بھی اگر، کرے گا پیدا ", "یہی سلسلۂ شوق اور منزل، اور سفر"],
        ["یہ شوق تیری پہچان ہے اے آدم ", "لمحہ لمحہ موج تیری دل سے اٹھتی ہے مثلِ بحر"],
        ["آصفوں کا ہوا ہم سے کیا اِک گزر ", "ہم سمجھ بیٹھے خود کو اہلِ نظر"],
        ["ہمیشہ بس ناکامیاں ہی ہوئیں ", "میری سعیوں کا کب ہوگا حاصل ثمر"],
        ["ہم تو درِ انتظارِ قیامت ہے ", "آگے پیچھے ہے بس یہاں ظالم ظفر"],
        ["آج بھی ہوں تاریکیوں میں نغمہ زن ", "\"قرآن است در شب نورِ قمر\""],
        ["مٹ گئی ہے آصفوں سے چمک ", "ہو گئی بے منزل یہ جستجو و سفر"]
    ]
}, {
    "couplets": [
        ["یہ دل ہے کوئی گزرگاہ تو نہیں ", "یہاں ٹھہر جانا کوئی گناہ تو نہیں"],
        ["یہ گل ہے کہ کوئی کانٹا ہے ", "دور سے ہی دیکھ جاؤ ایسی نگاہ تو نہیں"],
        ["کھڑی ہو گئی فجر کی جماعت ", "خواب ہی ہوگا، ابھی تو صبح تو نہیں"],
        ["اس امید سے عدالت میں آیا ہوں ", "کہ یہ کوئی شاہ کی بارگاہ تو نہیں"],
        ["ایسا نہ ہو کہ یاور ہو زیاں ", "کہ اُس کے سوا اُس کی کوئی پناہ تو نہیں"]
    ]
}, {
    "couplets": [
        ["کرتا تھا کوئی سرما بھی کوئی نخلستان بھی ", "کرتا ہے اب مہمان ہم کو ریگستان بھی"],
        ["ابھی بچے ہیں یہاں کچھ اور دن ", "پھر درمان، پھر دیکھنا ہے قبرستان بھی"],
        ["جو پایا اس کو تھاما، جو چھوٹا اسے چھوڑ دیا ", "کس کا تھا گمان ذہن سے مٹ جائے گا یہ دبستان بھی"],
        ["کبھی بس بستے میں ایک بوجھ ہی تھا ", "آج پڑھو تو اک علامت ہے کتابِ بہارستان بھی"],
        ["اب تو ہے یہی میری زبان پر ", "کشمیر زندہ باد، زندہ باد پاکستان بھی"]
    ]
}, {
    "couplets": [
        ["ہم خوش ہیں کہ بنامِ بے غیرت مریں ", "اس جہل سے کہیں دور گمنام کہیں با حکمت مریں"],
        ["اگر نصیب نہیں موقع تو کیوں فساد پیدا کریں ", "یہ کافی ہے ہم طالبِ شہادت مریں"],
        ["کوئی فتح قریب تو نہیں دکھتی ہمیں ", "کیوں اپنوں کے لیے بس ایک سامانِ عبرت مریں"],
        ["کچھ قطرے خون سے بجھ جاتی ہوگی تمہاری پیاس ", "ہم کو طلب ہے انصاف کی؛ کیوں نہ در انتظارِ قیامت مریں"],
        ["اگر سہی نہیں جاتی ہے ہر روز کی یہ داستان ", "صبر کے ساتھ خدا کے حضور لے کے شکایت مریں"]
    ]
}, {
    "couplets": [
        ["کر لو، کر لو عیش، پھر تو آنی آنی ہے ", "کر لو، کر لو عذر پیش، پھر تو آنی آنی ہے"],
        ["اے ظالم! کیا انتہا پا ر کرے گا ظلم کی؟ ", "اب کہہ بھی دو: \"ہاں، کم و بیش!\" پھر تو آنی آنی ہے"],
        ["ابھی اٹھا لو مُلّا دنیا کے مزے، ", "رکھ لو لمبے کیس و ریش پھر تو آنی آنی ہے"],
        ["کیا ہونا چاہیے پہلے: انصاف یا مفاد؟ ", "کہہ دو کہہ دو مفاد و دیش پھر تو آنی آنی ہے"],
        ["جب وہ ملک سُورہ لے کے آیا، ", "فَرِستادہؔ لپیٹے خیش پھر تو آنی آنی ہے"],
        ["حاشیہ",
            "فَرِستادہؔ یعنی رسول اللہ صلی اللہ علیہ وسلم"
        ]
    ]
}, {
    "couplets": [
        ["چوٹ پہ کبھی مرہم نہیں لگا، اب درد کی عادت سی لگی ", "چند لمحوں کا فریب تھا، ہم کو رفاقت سی لگی"],
        ["کوئی گل ہی تھا یا کوئی چہرہ دیکھا تھا؟ ", "چھوتے ہی بکھر جائے ایسی نزاکت سی لگی"],
        ["تہذیب کے اس یلغار میں کون کس طرف؟ ", "وہ اپنے آپ میں شاہد کی شہادت سی لگی"],
        ["وہ تمنا رہی ہم کو کچھ دیر ہی سہی ", "پر طلب ایسی تھی کہ ہم کو حسرت سی لگی"],
        ["وہ لالہ زار، وہ سبز میدان و آبشار ", "اُس وقت ہم کو یہ زینتیں کفایت سی لگی"]
    ]
}, {
    "couplets": [
        ["اب منزل ہے، کبھی بس اک خیال آیا تھا ", "تمنا ہی مٹ گئی جب وقتِ وصال آیا تھا"],
        ["اب شاید میں پھر سے چلوں اسی راہ پہ ", "پہلے چوک گیا تھا میں جب حکمِ کمال آیا تھا"],
        ["میں گر گر کے بھاگا منزل کی اور، پھر گر کے نہ اٹھا ", "کیا کرتا کہ تب نظر بس تیرا خط و خال آیا تھا"],
        ["جب تجھے دیکھا، تھی ہوا میں خوشبو ", "تہذیب میں تیرے ترنم، نظر مثالِ جمال آیا تھا"],
        ["اب بھی وہ سحر ہے تیرے جمال کا لیکن ", "تیرے اخلاق بھی دیکھے ہیں جب وہ احتمال آیا تھا"],
        ["گل سمیٹتا ہوں، اس لیے اس لالہ زار میں آج ", "لینے اور مہک اور تصویر آج کہ شوقِ ارتجال آیا تھا"]
    ]
}, {
    "couplets": [
        ["اگر اب بھی ہو وہ شوقِ شعر و سخن تو کیا کہنے ہو ", "اگر اب بھی ہو وہ بہارِ چمن تو کیا کہنے ہو"],
        ["گھر سے کہیں دور ہوں کسی انجان دہر ", "اگر اب بھی ہو وہ نشیمن تو کیا کہنے ہو"],
        ["دکھ درد سمیٹے بیٹھا ہوں ", "کہ دکھ بانٹنے کو ملے کوئی ہم وطن تو کیا کہنے ہو"],
        ["جنگ و جدال ہے ہر طرف برپا یہاں ", "ہو بس اگر انتظامِ کفن تو کیا کہنے ہو"],
        ["ہر طرف ہے چرچا میرے گناہوں کا ", "صفائی کو ملے الفاظ کا پیرہن تو کیا کہنے ہو"],
        ["پسِ پردہ ہو اور ابھی سے یہ حال ہے ", "دیکھ لیا تو رک ہی جائے گی دھڑکن تو کیا کہنے ہو"],
        ["بندۂ جدید ہے شوق و فرصت سے خالی ", "کبھی ملے اس کو شام اور خالی ذہن تو کیا کہنے ہو"],
        ["صدیوں سے پھول نہیں دیکھے ہیں میں نے ", "آج جائے قرار ہو درکنارِ گلشن تو کیا کہنے ہو"]
    ]
}, {
    "couplets": [
        ["اپنی آنکھیں بند کر لیتی ہے دنیا", "ایسے ہی کنارے کر دیتی ہے دنیا"],
        ["غم نہ کھا، اے فلسطین، تیرا سب کچھ لُٹ گیا", "\"اب یہ آخری بار\" کہہ دیتی ہے دنیا"],
        ["میرا دل چیر چیر، تنہائیوں میں میں تو رویا", "کچھ جزا فضا ہو بھی اگر، پھر بھول جاتی ہے دنیا"],
        ["تب بھی ہم لاچار، اب بھی ہم لاچار", "روز روز ہم پہ روند کے گزر جاتی ہے دنیا"],
        ["وہ شاید کل کے قصے ہیں امن و امان کے", "شاید کہ تا قیامت اسی کے خواب دیکھتی ہے دنیا"],
        ["اب نہ لکھے گا یاورؔ کوئی اور دردِ حیات", "ایسے ہی نہیں، جرمِ ضعیفی معاف کرتی ہے دنیا"]
    ]
}, {
    "couplets": [
        ["بس چندیا گئی آنکھیں اس روشنیِ بیکار سے", "تیرے سوا کہیں دل نہ لگا کسے لالہ زار سے"],
        ["کہنے کو تو کہتے ہیں کہ گریز ہے اب پیار سے", "معلوم ہے کہ ہر دن گزرتے ہیں یہ دلوں کے بازار سے"],
        ["یہاں کوہِ دامن ہے، اس ندی شور بھی", "پھر کیا مزہ آئے گا وہاں سیمنٹ کے امبار سے"],
        ["چلو یارو نکلیں کہیں شوق سے گلزار میں", "کیا پتا کل چھڑ جائے گی جنگ کس یار سے"]
    ]
}, {
    "couplets": [
        ["انسان کے لیے جلے ہیں شمعِ موم کتنے", "طمعِ انسان نے جلائے شہرِ روم کتنے"],
        ["اک شاخ تھی نگہبان، تھی ظلِ الٰہی", "اب اس شاخ پہ جمع ہیں یہ بم کتنے"],
        ["اطمینان نہ ہے ان کو، جو ہے اس پہ", "نجانے مٹیں گے اس خواب پر معصوم کتنے"],
        ["اب کھل گئے ہیں ہم پہ اور اثر و رموز", "نجانے اب جڑیں گے نئے فاقۂ صوم کتنے"],
        ["کہتے ہو کہ ہم تو مسافر ہیں، اک جگہ کیسے رہیں", "نجانے بنائے ہوں گے تم نے عشق محروم کتنے"]
    ]
}]